Autodesk.Navisworks.Api.ViewpointLighting
The lighting of the viewpoint

Autodesk.Navisworks.Api.ViewpointLighting.None
Turns off lighting completely

Autodesk.Navisworks.Api.ViewpointLighting.SceneLights
Lights provided by user in model

Autodesk.Navisworks.Api.ViewpointLighting.Headlight
An automatic headlight provided by viewer

Autodesk.Navisworks.Api.ViewpointLighting.FullLights
Advanced level of lighting, implemented by application